#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3f59bd00-3986-404a-956b-12c9d4bc0a2a]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=25f76ff9-6fe1-4cfd-bb95-cfce03654e34]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a7e342e5-ee7d-40ba-aebe-c6ca3d5739f1]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1abddc22-2004-4541-ae56-b3d3043598d2]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b4969680-f1bd-4168-b6c7-88335fb38b0f]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8b085dc0-1114-49fb-a5ef-b1bd11a9ad37]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=96a6d729-1893-49c2-8085-386321fbf0dc]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=96ca4e0a-cd09-4f99-9edf-757b2113c99b]
module.keycloak_test.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ff1588e0-7e0e-4511-aebe-19327007783c]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dd6f4dfb-85ac-45d9-9d57-5b6ee14a7391]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3e70028b-753a-4385-9398-a69ed65f20ac]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ca665e60-7ff0-4c79-864e-2f7ce18aa57b]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4a7bcc08-6394-4e72-ab50-cb5a82acdc12]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce14196b-0dd9-4ee9-b98b-30daf991d409]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7bd5b16c-fefe-4e95-a641-0f75dc0c47a5]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7745dbee-3336-4404-aa78-c2d67d1c4958]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c73d46d8-f273-407e-832e-5c19f5d337d0]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d191c0be-d2b3-4270-a403-fbef89d05707]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75c5ce43-21c0-4adc-9c88-b67094370396]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=30f6ac74-bca2-47bd-af4e-e99340d9f388]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=400e247f-98d9-4a7a-8494-d32a81226d15]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0964a154-2cf8-4eed-a061-8c5b8839090b]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=11740a6d-e1bc-4358-b69b-d20c40ad6ede]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=730c7919-42d5-4016-bb52-785cf12f4ae4]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5e43537d-44da-4dd0-9627-c97d2b19ecc6]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=14f3dc3a-cfcd-436b-b267-2a181961b625]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=64bcfa78-ab2f-4516-a330-dd3098274569]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a228895b-fecd-4965-ab59-5d0210b8e21c]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bb0171f7-2b68-49d5-8e97-51ae209f40bf]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1f396a8b-8f1c-4876-90dd-d58a3e66b6a1]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=26e0234d-a7d6-4e93-94b8-94d364f41cf8]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b81b2668-eb5e-4773-9951-ff68fee91bb5]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=483d17c4-fa37-4c5d-a861-6295d989d153]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=72f3aa97-6420-4c69-9b79-cf4faccebdff]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b9dd5d14-ba60-4a92-9ee8-647cee399237]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d7ad910e-c22c-4eed-8efc-39d6d6f9edfa]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9baedb04-e7f8-4ca6-93ca-5374399d3f1f]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb437a3f-248d-480b-b6e9-03618f1baea6]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7ba0e21e-fdb7-457c-aad0-f2adf19bbcce]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4cd357f0-ebcc-4204-a6e6-2b29c134640a]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e6476adb-2ffb-471c-a9c0-d7f6361e8507]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=935ff7cb-a126-4216-ad71-45da47f82ac5]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=19631743-2703-4271-8310-27782c832850]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c2ac7362-580b-4088-8c97-c1a2a3481fda]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ad9328cc-f535-4f7f-869f-207443949070]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1c957d58-1be0-4bc8-8587-29f27cd85bc8]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8576c4b4-67a0-4a51-8812-34d5866a56d0]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8c19e771-4979-42a1-a9b1-bc76281244bb]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2bcf65c-da6e-4f30-b363-a912f862f75b]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf7bdbd6-4d80-448e-964f-8130cdfd46d5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1685"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1685.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1685"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1685"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1685"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1685.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1685"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1685"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1685"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1685.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1685.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1685"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1685"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2009 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*